RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_i2c.c
/***************COPYRIGHT(C)  2019 WCH. A11 rights reserved*********************
* File Name          : ch32f10x_i2c.c
* Author             : WCH
* Version            : V1.0.0
* Date               : 2019/10/15
* Description        : This file provides all the I2C firmware functions. 
*******************************************************************************/ 
#include "ch32f10x_i2c.h"
#include "ch32f10x_rcc.h"


/* I2C SPE mask */
#define CTLR1_PE_Set              ((uint16_t)0x0001)
#define CTLR1_PE_Reset            ((uint16_t)0xFFFE)

/* I2C START mask */
#define CTLR1_START_Set           ((uint16_t)0x0100)
#define CTLR1_START_Reset         ((uint16_t)0xFEFF)

/* I2C STOP mask */
#define CTLR1_STOP_Set            ((uint16_t)0x0200)
#define CTLR1_STOP_Reset          ((uint16_t)0xFDFF)

/* I2C ACK mask */
#define CTLR1_ACK_Set             ((uint16_t)0x0400)
#define CTLR1_ACK_Reset           ((uint16_t)0xFBFF)

/* I2C ENGC mask */
#define CTLR1_ENGC_Set            ((uint16_t)0x0040)
#define CTLR1_ENGC_Reset          ((uint16_t)0xFFBF)

/* I2C SWRST mask */
#define CTLR1_SWRST_Set           ((uint16_t)0x8000)
#define CTLR1_SWRST_Reset         ((uint16_t)0x7FFF)

/* I2C PEC mask */
#define CTLR1_PEC_Set             ((uint16_t)0x1000)
#define CTLR1_PEC_Reset           ((uint16_t)0xEFFF)

/* I2C ENPEC mask */
#define CTLR1_ENPEC_Set           ((uint16_t)0x0020)
#define CTLR1_ENPEC_Reset         ((uint16_t)0xFFDF)

/* I2C ENARP mask */
#define CTLR1_ENARP_Set           ((uint16_t)0x0010)
#define CTLR1_ENARP_Reset         ((uint16_t)0xFFEF)

/* I2C NOSTRETCH mask */
#define CTLR1_NOSTRETCH_Set       ((uint16_t)0x0080)
#define CTLR1_NOSTRETCH_Reset     ((uint16_t)0xFF7F)

/* I2C registers Masks */
#define CTLR1_CLEAR_Mask          ((uint16_t)0xFBF5)

/* I2C DMAEN mask */
#define CTLR2_DMAEN_Set           ((uint16_t)0x0800)
#define CTLR2_DMAEN_Reset         ((uint16_t)0xF7FF)

/* I2C LAST mask */
#define CTLR2_LAST_Set            ((uint16_t)0x1000)
#define CTLR2_LAST_Reset          ((uint16_t)0xEFFF)

/* I2C FREQ mask */
#define CTLR2_FREQ_Reset          ((uint16_t)0xFFC0)

/* I2C ADD0 mask */
#define OADDR1_ADD0_Set           ((uint16_t)0x0001)
#define OADDR1_ADD0_Reset         ((uint16_t)0xFFFE)

/* I2C ENDUAL mask */
#define OADDR2_ENDUAL_Set         ((uint16_t)0x0001)
#define OADDR2_ENDUAL_Reset       ((uint16_t)0xFFFE)

/* I2C ADD2 mask */
#define OADDR2_ADD2_Reset         ((uint16_t)0xFF01)

/* I2C F/S mask */
#define CKCFGR_FS_Set             ((uint16_t)0x8000)

/* I2C CCR mask */
#define CKCFGR_CCR_Set            ((uint16_t)0x0FFF)

/* I2C FLAG mask */
#define FLAG_Mask                 ((uint32_t)0x00FFFFFF)

/* I2C Interrupt Enable mask */
#define ITEN_Mask                 ((uint32_t)0x07000000)


/*******************************************************************************
* Function Name  : I2C_DeInit
* Description    : Deinitializes the I2Cx peripheral registers to their default 
*      reset values.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
* Return         : None
*******************************************************************************/	
void I2C_DeInit(I2C_TypeDef* I2Cx)
{
  if (I2Cx == I2C1)
  {
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_I2C1, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_I2C1, DISABLE);
  }
  else
  {
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_I2C2, ENABLE);
    RCC_APB1PeriphResetCmd(RCC_APB1Periph_I2C2, DISABLE);
  }
}

/*******************************************************************************
* Function Name  : I2C_Init
* Description    : Initializes the I2Cx peripheral according to the specified 
*      parameters in the I2C_InitStruct.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
*                  I2C_InitStruct: pointer to a I2C_InitTypeDef structure that
*      contains the configuration information for the specified I2C peripheral.
* Return         : None
*******************************************************************************/	
void I2C_Init(I2C_TypeDef* I2Cx, I2C_InitTypeDef* I2C_InitStruct)
{
  uint16_t tmpreg = 0, freqrange = 0;
  uint16_t result = 0x04;
  uint32_t pclk1 = 8000000;
	
  RCC_ClocksTypeDef  rcc_clocks;

/*---------------------------- I2Cx CR2 Configuration ------------------------*/
  tmpreg = I2Cx->CTLR2;
  tmpreg &= CTLR2_FREQ_Reset;
  RCC_GetClocksFreq(&rcc_clocks);
  pclk1 = rcc_clocks.PCLK1_Frequency;
  freqrange = (uint16_t)(pclk1 / 1000000);
  tmpreg |= freqrange;
  I2Cx->CTLR2 = tmpreg;

/*---------------------------- I2Cx CCR Configuration ------------------------*/
  I2Cx->CTLR1 &= CTLR1_PE_Reset;
  tmpreg = 0;

  if (I2C_InitStruct->I2C_ClockSpeed <= 100000)
  {
    result = (uint16_t)(pclk1 / (I2C_InitStruct->I2C_ClockSpeed << 1));

    if (result < 0x04)
    {
      result = 0x04;  
    }
		
    tmpreg |= result;	  
    I2Cx->RTR = freqrange + 1; 
  }
  else 
  {
    if (I2C_InitStruct->I2C_DutyCycle == I2C_DutyCycle_2)
    {
      result = (uint16_t)(pclk1 / (I2C_InitStruct->I2C_ClockSpeed * 3));
    }
    else
    {
      result = (uint16_t)(pclk1 / (I2C_InitStruct->I2C_ClockSpeed * 25));
      result |= I2C_DutyCycle_16_9;
    }

    if ((result & CKCFGR_CCR_Set) == 0)
    {
      result |= (uint16_t)0x0001;  
    }
		
    tmpreg |= (uint16_t)(result | CKCFGR_FS_Set);
    I2Cx->RTR = (uint16_t)(((freqrange * (uint16_t)300) / (uint16_t)1000) + (uint16_t)1);  
  }

  I2Cx->CKCFGR = tmpreg;
  I2Cx->CTLR1 |= CTLR1_PE_Set;

/*---------------------------- I2Cx CR1 Configuration ------------------------*/
  tmpreg = I2Cx->CTLR1;
  tmpreg &= CTLR1_CLEAR_Mask;
  tmpreg |= (uint16_t)((uint32_t)I2C_InitStruct->I2C_Mode | I2C_InitStruct->I2C_Ack);
  I2Cx->CTLR1 = tmpreg;

/*---------------------------- I2Cx OAR1 Configuration -----------------------*/
  I2Cx->OADDR1 = (I2C_InitStruct->I2C_AcknowledgedAddress | I2C_InitStruct->I2C_OwnAddress1);
}

/*******************************************************************************
* Function Name  : I2C_StructInit
* Description    : Fills each I2C_InitStruct member with its default value.
* Input          : I2C_InitStruct: pointer to an I2C_InitTypeDef structure which 
*      will be initialized.
* Return         : None
*******************************************************************************/
void I2C_StructInit(I2C_InitTypeDef* I2C_InitStruct)
{
/*---------------- Reset I2C init structure parameters values ----------------*/
  I2C_InitStruct->I2C_ClockSpeed = 5000;
  I2C_InitStruct->I2C_Mode = I2C_Mode_I2C;
  I2C_InitStruct->I2C_DutyCycle = I2C_DutyCycle_2;
  I2C_InitStruct->I2C_OwnAddress1 = 0;
  I2C_InitStruct->I2C_Ack = I2C_Ack_Disable;
  I2C_InitStruct->I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
}

