RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_i2c.c
/*******************************************************************************
* Function Name  : I2C_Cmd
* Description    : Enables or disables the specified I2C peripheral.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral. 
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void I2C_Cmd(I2C_TypeDef* I2Cx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    I2Cx->CTLR1 |= CTLR1_PE_Set;
  }
  else
  {
    I2Cx->CTLR1 &= CTLR1_PE_Reset;
  }
}

/*******************************************************************************
* Function Name  : I2C_DMACmd
* Description    : Enables or disables the specified I2C DMA requests.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral. 
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void I2C_DMACmd(I2C_TypeDef* I2Cx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    I2Cx->CTLR2 |= CTLR2_DMAEN_Set;
  }
  else
  {
    I2Cx->CTLR2 &= CTLR2_DMAEN_Reset;
  }
}

/*******************************************************************************
* Function Name  : I2C_DMALastTransferCmd
* Description    : Specifies if the next DMA transfer will be the last one.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral. 
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void I2C_DMALastTransferCmd(I2C_TypeDef* I2Cx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    I2Cx->CTLR2 |= CTLR2_LAST_Set;
  }
  else
  {
    I2Cx->CTLR2 &= CTLR2_LAST_Reset;
  }
}

/*******************************************************************************
* Function Name  : I2C_GenerateSTART
* Description    : Generates I2Cx communication START condition.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral. 
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void I2C_GenerateSTART(I2C_TypeDef* I2Cx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    I2Cx->CTLR1 |= CTLR1_START_Set;
  }
  else
  {
    I2Cx->CTLR1 &= CTLR1_START_Reset;
  }
}

/*******************************************************************************
* Function Name  : I2C_GenerateSTOP
* Description    : Generates I2Cx communication STOP condition.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral. 
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void I2C_GenerateSTOP(I2C_TypeDef* I2Cx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    I2Cx->CTLR1 |= CTLR1_STOP_Set;
  }
  else
  {
    I2Cx->CTLR1 &= CTLR1_STOP_Reset;
  }
}

/*******************************************************************************
* Function Name  : I2C_AcknowledgeConfig
* Description    : Enables or disables the specified I2C acknowledge feature.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral. 
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void I2C_AcknowledgeConfig(I2C_TypeDef* I2Cx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    I2Cx->CTLR1 |= CTLR1_ACK_Set;
  }
  else
  {
    I2Cx->CTLR1 &= CTLR1_ACK_Reset;
  }
}

/*******************************************************************************
* Function Name  : I2C_OwnAddress2Config
* Description    : Configures the specified I2C own address2.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral. 
*                  Address: specifies the 7bit I2C own address2.
* Return         : None
*******************************************************************************/
void I2C_OwnAddress2Config(I2C_TypeDef* I2Cx, uint8_t Address)
{
  uint16_t tmpreg = 0;

  tmpreg = I2Cx->OADDR2;
  tmpreg &= OADDR2_ADD2_Reset;
  tmpreg |= (uint16_t)((uint16_t)Address & (uint16_t)0x00FE);
  I2Cx->OADDR2 = tmpreg;
}

/*******************************************************************************
* Function Name  : I2C_DualAddressCmd
* Description    : Enables or disables the specified I2C dual addressing mode.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral. 
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void I2C_DualAddressCmd(I2C_TypeDef* I2Cx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    I2Cx->OADDR2 |= OADDR2_ENDUAL_Set;
  }
  else
  {
    I2Cx->OADDR2 &= OADDR2_ENDUAL_Reset;
  }
}

/*******************************************************************************
* Function Name  : I2C_GeneralCallCmd
* Description    : Enables or disables the specified I2C general call feature.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral. 
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void I2C_GeneralCallCmd(I2C_TypeDef* I2Cx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    I2Cx->CTLR1 |= CTLR1_ENGC_Set;
  }
  else
  {
    I2Cx->CTLR1 &= CTLR1_ENGC_Reset;
  }
}

/*******************************************************************************
* Function Name  : I2C_ITConfig
* Description    : Enables or disables the specified I2C interrupts.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
*                  I2C_IT: specifies the I2C interrupts sources to be enabled or disabled.
*                    I2C_IT_BUF: Buffer interrupt mask.
*                    I2C_IT_EVT: Event interrupt mask.
*                    I2C_IT_ERR: Error interrupt mask.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void I2C_ITConfig(I2C_TypeDef* I2Cx, uint16_t I2C_IT, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    I2Cx->CTLR2 |= I2C_IT;
  }
  else
  {
    I2Cx->CTLR2 &= (uint16_t)~I2C_IT;
  }
}

