RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_i2c.c
/*******************************************************************************
* Function Name  : I2C_SendData
* Description    : Sends a data byte through the I2Cx peripheral.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
*                  Data: Byte to be transmitted.
* Return         : None
*******************************************************************************/
void I2C_SendData(I2C_TypeDef* I2Cx, uint8_t Data)
{
  I2Cx->DATAR = Data;
}

/*******************************************************************************
* Function Name  : I2C_ReceiveData
* Description    : Returns the most recent received data by the I2Cx peripheral.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
* Return         : The value of the received data.
*******************************************************************************/
uint8_t I2C_ReceiveData(I2C_TypeDef* I2Cx)
{
  return (uint8_t)I2Cx->DATAR;
}

/*******************************************************************************
* Function Name  : I2C_Send7bitAddress
* Description    : Transmits the address byte to select the slave device.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
*                  Address: specifies the slave address which will be transmitted.
*                  I2C_Direction: specifies whether the I2C device will be a
*      Transmitter or a Receiver. 
*                    I2C_Direction_Transmitter: Transmitter mode.
*                    I2C_Direction_Receiver: Receiver mode.
* Return         : None
*******************************************************************************/
void I2C_Send7bitAddress(I2C_TypeDef* I2Cx, uint8_t Address, uint8_t I2C_Direction)
{
  if (I2C_Direction != I2C_Direction_Transmitter)
  {
    Address |= OADDR1_ADD0_Set;
  }
  else
  {
    Address &= OADDR1_ADD0_Reset;
  }

  I2Cx->DATAR = Address;
}

/*******************************************************************************
* Function Name  : I2C_ReadRegister
* Description    : Reads the specified I2C register and returns its value.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
*                  I2C_Register: specifies the register to read.
*                    I2C_Register_CTLR1.
*                    I2C_Register_CTLR2.
*                    I2C_Register_OADDR1.
*                    I2C_Register_OADDR2.
*                    I2C_Register_DATAR.
*                    I2C_Register_STAR1.
*                    I2C_Register_STAR2.
*                    I2C_Register_CKCFGR.
*                    I2C_Register_RTR.
* Return         : The value of the received data.
*******************************************************************************/
uint16_t I2C_ReadRegister(I2C_TypeDef* I2Cx, uint8_t I2C_Register)
{
  __IO uint32_t tmp = 0;

  tmp = (uint32_t) I2Cx;
  tmp += I2C_Register;

  return (*(__IO uint16_t *) tmp);
}

/*******************************************************************************
* Function Name  : I2C_SoftwareResetCmd
* Description    : Enables or disables the specified I2C software reset.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void I2C_SoftwareResetCmd(I2C_TypeDef* I2Cx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    I2Cx->CTLR1 |= CTLR1_SWRST_Set;
  }
  else
  {
    I2Cx->CTLR1 &= CTLR1_SWRST_Reset;
  }
}

/*******************************************************************************
* Function Name  : I2C_NACKPositionConfig
* Description    : Selects the specified I2C NACK position in master receiver mode. 
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
*                  I2C_NACKPosition: specifies the NACK position.
*                    I2C_NACKPosition_Next: indicates that the next byte will be 
*      the last received byte.  
*                    I2C_NACKPosition_Current: indicates that current byte is the
*      last received byte.
* Return         : None
*******************************************************************************/
void I2C_NACKPositionConfig(I2C_TypeDef* I2Cx, uint16_t I2C_NACKPosition)
{
  if (I2C_NACKPosition == I2C_NACKPosition_Next)
  {
    I2Cx->CTLR1 |= I2C_NACKPosition_Next;
  }
  else
  {
    I2Cx->CTLR1 &= I2C_NACKPosition_Current;
  }
}

/*******************************************************************************
* Function Name  : I2C_SMBusAlertConfig
* Description    : Drives the SMBusAlert pin high or low for the specified I2C.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
*                  I2C_SMBusAlert: specifies SMBAlert pin level. 
*                    I2C_SMBusAlert_Low: SMBAlert pin driven low.
*                    I2C_SMBusAlert_High: SMBAlert pin driven high.
* Return         : None
*******************************************************************************/
void I2C_SMBusAlertConfig(I2C_TypeDef* I2Cx, uint16_t I2C_SMBusAlert)
{
  if (I2C_SMBusAlert == I2C_SMBusAlert_Low)
  {
    I2Cx->CTLR1 |= I2C_SMBusAlert_Low;
  }
  else
  {
    I2Cx->CTLR1 &= I2C_SMBusAlert_High;
  }
}

/*******************************************************************************
* Function Name  : I2C_TransmitPEC
* Description    : Enables or disables the specified I2C PEC transfer.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void I2C_TransmitPEC(I2C_TypeDef* I2Cx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    I2Cx->CTLR1 |= CTLR1_PEC_Set;
  }
  else
  {
    I2Cx->CTLR1 &= CTLR1_PEC_Reset;
  }
}

/*******************************************************************************
* Function Name  : I2C_PECPositionConfig
* Description    : Selects the specified I2C PEC position.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
*                  I2C_PECPosition: specifies the PEC position. 
*                    I2C_PECPosition_Next: indicates that the next byte is PEC.
*                    I2C_PECPosition_Current: indicates that current byte is PEC.
* Return         : None
*******************************************************************************/
void I2C_PECPositionConfig(I2C_TypeDef* I2Cx, uint16_t I2C_PECPosition)
{
  if (I2C_PECPosition == I2C_PECPosition_Next)
  {
    I2Cx->CTLR1 |= I2C_PECPosition_Next;
  }
  else
  {
    I2Cx->CTLR1 &= I2C_PECPosition_Current;
  }
}

