RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_i2c.c
/*******************************************************************************
* Function Name  : I2C_CheckEvent
* Description    : Checks whether the last I2Cx Event is equal to the one passed
*      as parameter.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
*                  I2C_EVENT: specifies the event to be checked. 
*                    I2C_EVENT_SLAVE_TRANSMITTER_ADDRESS_MATCHED           : EV1.
*                    I2C_EVENT_SLAVE_RECEIVER_ADDRESS_MATCHED              : EV1.
*                    I2C_EVENT_SLAVE_TRANSMITTER_SECONDADDRESS_MATCHED     : EV1.
*                    I2C_EVENT_SLAVE_RECEIVER_SECONDADDRESS_MATCHED        : EV1.
*                    I2C_EVENT_SLAVE_GENERALCALLADDRESS_MATCHED            : EV1.
*                    I2C_EVENT_SLAVE_BYTE_RECEIVED                         : EV2.
*                    (I2C_EVENT_SLAVE_BYTE_RECEIVED | I2C_FLAG_DUALF)      : EV2.
*                    (I2C_EVENT_SLAVE_BYTE_RECEIVED | I2C_FLAG_GENCALL)    : EV2.
*                    I2C_EVENT_SLAVE_BYTE_TRANSMITTED                      : EV3.
*                    (I2C_EVENT_SLAVE_BYTE_TRANSMITTED | I2C_FLAG_DUALF)   : EV3.
*                    (I2C_EVENT_SLAVE_BYTE_TRANSMITTED | I2C_FLAG_GENCALL) : EV3.
*                    I2C_EVENT_SLAVE_ACK_FAILURE                           : EV3_2.
*                    I2C_EVENT_SLAVE_STOP_DETECTED                         : EV4.
*                    I2C_EVENT_MASTER_MODE_SELECT                          : EV5.
*                    I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED            : EV6.    
*                    I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED               : EV6.
*                    I2C_EVENT_MASTER_BYTE_RECEIVED                        : EV7.
*                    I2C_EVENT_MASTER_BYTE_TRANSMITTING                    : EV8.
*                    I2C_EVENT_MASTER_BYTE_TRANSMITTED                     : EV8_2.
*                    I2C_EVENT_MASTER_MODE_ADDRESS10                       : EV9.
* Return         : ErrorStatus: SUCCESS or ERROR.
*******************************************************************************/	
ErrorStatus I2C_CheckEvent(I2C_TypeDef* I2Cx, uint32_t I2C_EVENT)
{
  uint32_t lastevent = 0;
  uint32_t flag1 = 0, flag2 = 0;
  ErrorStatus status = ERROR;

  flag1 = I2Cx->STAR1;
  flag2 = I2Cx->STAR2;
  flag2 = flag2 << 16;

  lastevent = (flag1 | flag2) & FLAG_Mask;

  if ((lastevent & I2C_EVENT) == I2C_EVENT)
  {
    status = SUCCESS;
  }
  else
  {
    status = ERROR;
  }

  return status;
}

/**
 * 
 *  2) Advanced state monitoring
 *******************************************************************************
 */

/*******************************************************************************
* Function Name  : I2C_GetLastEvent
* Description    : Returns the last I2Cx Event.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
* Return         : The last event.
*******************************************************************************/
uint32_t I2C_GetLastEvent(I2C_TypeDef* I2Cx)
{
  uint32_t lastevent = 0;
  uint32_t flag1 = 0, flag2 = 0;

  flag1 = I2Cx->STAR1;
  flag2 = I2Cx->STAR2;
  flag2 = flag2 << 16;
  lastevent = (flag1 | flag2) & FLAG_Mask;

  return lastevent;
}

/**
 * 
 *  3) Flag-based state monitoring
 *******************************************************************************
 */

/*******************************************************************************
* Function Name  : I2C_GetFlagStatus
* Description    : Checks whether the last I2Cx Event is equal to the one passed
*      as parameter.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
*                  I2C_FLAG: specifies the flag to check.  
*                    I2C_FLAG_DUALF: Dual flag (Slave mode).
*                    I2C_FLAG_SMBHOST: SMBus host header (Slave mode).
*                    I2C_FLAG_SMBDEFAULT: SMBus default header (Slave mode).
*                    I2C_FLAG_GENCALL: General call header flag (Slave mode).
*                    I2C_FLAG_TRA: Transmitter/Receiver flag.
*                    I2C_FLAG_BUSY: Bus busy flag.
*                    I2C_FLAG_MSL: Master/Slave flag.
*                    I2C_FLAG_SMBALERT: SMBus Alert flag.
*                    I2C_FLAG_TIMEOUT: Timeout or Tlow error flag.
*                    I2C_FLAG_PECERR: PEC error in reception flag.
*                    I2C_FLAG_OVR: Overrun/Underrun flag (Slave mode).
*                    I2C_FLAG_AF: Acknowledge failure flag.
*                    I2C_FLAG_ARLO: Arbitration lost flag (Master mode).
*                    I2C_FLAG_BERR: Bus error flag.
*                    I2C_FLAG_TXE: Data register empty flag (Transmitter).
*                    I2C_FLAG_RXNE: Data register not empty (Receiver) flag.
*                    I2C_FLAG_STOPF: Stop detection flag (Slave mode).
*                    I2C_FLAG_ADD10: 10-bit header sent flag (Master mode).
*                    I2C_FLAG_BTF: Byte transfer finished flag.
*                    I2C_FLAG_ADDR: Address sent flag (Master mode) "ADSL"
*      Address matched flag (Slave mode)"ENDA".
*                    I2C_FLAG_SB: Start bit flag (Master mode).
* Return         : FlagStatus: SET or RESET.
*******************************************************************************/
FlagStatus I2C_GetFlagStatus(I2C_TypeDef* I2Cx, uint32_t I2C_FLAG)
{
  FlagStatus bitstatus = RESET;
  __IO uint32_t i2creg = 0, i2cxbase = 0;

  i2cxbase = (uint32_t)I2Cx;
  i2creg = I2C_FLAG >> 28;
  I2C_FLAG &= FLAG_Mask;
  
  if(i2creg != 0)
  {
    i2cxbase += 0x14;
  }
  else
  {
    I2C_FLAG = (uint32_t)(I2C_FLAG >> 16);
    i2cxbase += 0x18;
  }
  
  if(((*(__IO uint32_t *)i2cxbase) & I2C_FLAG) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  
  return  bitstatus;
}

/*******************************************************************************
* Function Name  : I2C_ClearFlag
* Description    : Clears the I2Cx's pending flags.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
*                  I2C_FLAG: specifies the flag to clear. 
*                    I2C_FLAG_SMBALERT: SMBus Alert flag.
*                    I2C_FLAG_TIMEOUT: Timeout or Tlow error flag.
*                    I2C_FLAG_PECERR: PEC error in reception flag.
*                    I2C_FLAG_OVR: Overrun/Underrun flag (Slave mode).
*                    I2C_FLAG_AF: Acknowledge failure flag.
*                    I2C_FLAG_ARLO: Arbitration lost flag (Master mode).
*                    I2C_FLAG_BERR: Bus error flag.                   
* Return         : None
*******************************************************************************/
void I2C_ClearFlag(I2C_TypeDef* I2Cx, uint32_t I2C_FLAG)
{
  uint32_t flagpos = 0;

  flagpos = I2C_FLAG & FLAG_Mask;
  I2Cx->STAR1 = (uint16_t)~flagpos;
}
	
