RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_i2c.c
/*******************************************************************************
* Function Name  : I2C_GetITStatus
* Description    : Checks whether the specified I2C interrupt has occurred or not.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
*                  II2C_IT: specifies the interrupt source to check. 
*                    I2C_IT_SMBALERT: SMBus Alert flag.
*                    I2C_IT_TIMEOUT: Timeout or Tlow error flag.
*                    I2C_IT_PECERR: PEC error in reception flag.
*                    I2C_IT_OVR: Overrun/Underrun flag (Slave mode).
*                    I2C_IT_AF: Acknowledge failure flag.
*                    I2C_IT_ARLO: Arbitration lost flag (Master mode).
*                    I2C_IT_BERR: Bus error flag.
*                    I2C_IT_TXE: Data register empty flag (Transmitter).
*                    I2C_IT_RXNE: Data register not empty (Receiver) flag.
*                    I2C_IT_STOPF: Stop detection flag (Slave mode).
*                    I2C_IT_ADD10: 10-bit header sent flag (Master mode).
*                    I2C_IT_BTF: Byte transfer finished flag.
*                    I2C_IT_ADDR: Address sent flag (Master mode) "ADSL"  Address matched
*      flag (Slave mode)"ENDAD".
*                    I2C_IT_SB: Start bit flag (Master mode).                 
* Return         : None
*******************************************************************************/
ITStatus I2C_GetITStatus(I2C_TypeDef* I2Cx, uint32_t I2C_IT)
{
  ITStatus bitstatus = RESET;
  uint32_t enablestatus = 0;

  enablestatus = (uint32_t)(((I2C_IT & ITEN_Mask) >> 16) & (I2Cx->CTLR2)) ;
  I2C_IT &= FLAG_Mask;

  if (((I2Cx->STAR1 & I2C_IT) != (uint32_t)RESET) && enablestatus)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return  bitstatus;
}

/*******************************************************************************
* Function Name  : I2C_ClearITPendingBit
* Description    : Clears the I2Cx’s interrupt pending bits.
* Input          : I2Cx: where x can be 1 or 2 to select the I2C peripheral.
*                  I2C_IT: specifies the interrupt pending bit to clear. 
*                    I2C_IT_SMBALERT: SMBus Alert interrupt.
*                    I2C_IT_TIMEOUT: Timeout or Tlow error interrupt.
*                    I2C_IT_PECERR: PEC error in reception  interrupt.
*                    I2C_IT_OVR: Overrun/Underrun interrupt (Slave mode).
*                    I2C_IT_AF: Acknowledge failure interrupt.
*                    I2C_IT_ARLO: Arbitration lost interrupt (Master mode).
*                    I2C_IT_BERR: Bus error interrupt.               
* Return         : None
*******************************************************************************/
void I2C_ClearITPendingBit(I2C_TypeDef* I2Cx, uint32_t I2C_IT)
{
  uint32_t flagpos = 0;

  flagpos = I2C_IT & FLAG_Mask;
  I2Cx->STAR1 = (uint16_t)~flagpos;
}







